[
	{
		"Author": "Clover",
		"Name": "Immersive Flavor Text",
		"Punchline": "It provides more immersive flavor text.",
		"Description": "My garbage quality plugin to help me learn how to work with Dalamud.\r\nSomewhat of a RP toolkit, so far it only provides immersive flavor text.",
		"InternalName": "rpToolkit",
		"AssemblyVersion": "0.3.0.1",
		"ApplicableVersion": "any",
		"DalamudApiLevel": 8,
		"LoadPriority": 0,
		"RepoUrl": "https://github.com/StrawberryClover/ImmersiveFlavorText",
		"IconUrl": "https://cdn.iconscout.com/icon/free/png-256/rain-drops-1671402-1422407.png",
		"Changelog": "### New Features\r\n- [Feature] Consuming food/drinks will give you a bit of flavor text. Right now consumable data has only been added for all foods (specifically items in the meals category) with names starting A - M.\r\n- [Feature] New toggle in misc settings will allow you to automatically toggle walking when you enter a player house. This feature will be expanded upon hopefully soon.\r\n- [Feature] Drinks can now cool you down slightly, or warm you up!\r\n- [Feature] Temperature is now affected based on altitude.\r\n- [Feature] If you aren't swimming, but it is raining, the temperature will still go down a little bit. Also adjusted how much rainstorms affect the temperature.\r\n- [Feature] Outfits can now be set based on swimming conditions.\r\n- [Feature] Created debug tab in settings window. This is mostly just for myself, but will be a huge help in logging temperature data between zones and sub areas, amongst other things.\r\n\r\n### Fixes\r\n- Fixed random strings not returning last value\r\n- Fixed an issue regarding outfit changing that was causing outfits to be re-applied once every second in a loop.\r\n- Fixed an issue with flavor text showing up a bit wonky in emote chat types.\r\n- Removed support for HQ item differential in flavor text, this feature will return in the future, but for now I need to rethink how I do this.\r\n\r\n### Changed Data\r\n- Added new biome types: Ocean Floor, Sub Zero, Mountain\r\n- Changed Biome data for: Rainforests\r\n- Added weather data for Heat Waves (ID 26)\r\n- Added climate data for zones: Elpis, The Azim Steppe, Idyllshire, Middle La Noscea\r\n- Added climate data for duties: Anamnesis Anyder, Eden's Gate (Resurrection, Descent, Inundation, Supulture), Abyssos (fifth, sixth, seventh, and eighth + sub zones for quests), Shinryu (Extreme), Eden's Verse (Fulmination, Furor, Iconoclasm, Refulgence), Castrum Marinum, The Cloud Deck, Asphodelos: First Circle, The Antitower, Alphascape 1.0, Heroes' Gauntlet, Lapis Manalis, Sunken Temple of Qarn, Cutter's Cry, Praetorium, Great Gubal Library, Kugane Castle, World of Darkness, Halatali, Matoya's Relict, Akh Afah Amphitheatre, Cutter's Cry, Mount Ordeals, Fist of the Father, Eyes of the Creator, The Burn, Containment Bay P1T6, Steps of Faith, Hydra, Ala Mhigo, Tam-Tara Deepcroft\r\n- Added climate data for sub areas: Elysion, Artha, Ruveydah Fibers, Meghaduta Guest Chambers, Eastern Thanalan (BLM Job Quest), Masked Carnival, Wanderer's Palace - Long Hall, Eureka Pagos, Eureka Anemos, Company Workshop (Goblet), Private Quarters (Goblet), Cape Westwind (not Duty), Vesper Bay, Waking Sands, Anamnesis Anyder, Shifting Oubliettes of Lyhe Ghiah, All Sub Areas in Heros' Gauntlet, All Sub Areas in Lapis Manalis, Sanctum of the Twelve, Gangos, The Firmament, The Diadem, Leap of Faith - The Fall of Belah'dia, All Housing locations in The Goblet, Mist, Lavender Beds, Shirogane, and Empyreum\r\n- Added consumable data for all foods/drinks (Meals) with names starting A - M.",
		"ImageUrls": [],
		"DownloadLinkInstall": "https://github.com/StrawberryClover/ImmersiveFlavorText/releases/download/v0.3.0/latest.zip",
		"IsHide": false,
		"IsTestingExclusive": false,
		"TestingAssemblyVersion": "0.3.0.2",
		"DownloadLinkTesting": "https://github.com/StrawberryClover/ImmersiveFlavorText/raw/dev/RPToolkit/Test%20Build/latest.zip",
		"DownloadLinkUpdate": "https://github.com/StrawberryClover/ImmersiveFlavorText/releases/download/v0.3.0/latest.zip",
		"DownloadCount": 69,
		"LastUpdate": "1684748878",
		"AcceptsFeedback": false
	},
	{
		"Author": "StrawberryClover",
		"Name": "Aggro Range Visualizer",
		"InternalName": "AggroRangeVisualizer",
		"AssemblyVersion": "0.1.0.0",
		"Description": "Not a perfect attempt, mind you.\r\nJust for fun, so I can prove a point to friends.\r\nValues are hard coded, and not accurate for many mobs. Take it with a grain of salt. Again, this is mostly just for fun, to try and visualize what the aggro radius of mobs would look like.",
		"ApplicableVersion": "any",
		"Tags": [],
		"DalamudApiLevel": 10,
		"LoadRequiredState": 0,
		"LoadSync": false,
		"CanUnloadAsync": false,
		"LoadPriority": 0,
		"IconUrl": "https://1.bp.blogspot.com/--iIgq7znFOw/U4IHung6FbI/AAAAAAAAAbs/5JKAUZXSLH4/s1600/aggroradius.png",
		"IsHide": false,
		"IsTestingExclusive": false,
		"TestingAssemblyVersion": "0.1.0",
		"Punchline": "An attempt at visualizing mob aggro range.",
		"AcceptsFeedback": false,
		"RepoUrl": "https://github.com/StrawberryClover/AggroRangeVisualizer",
		"ImageUrls": [],
		"Changelog": "Idk man",
		"DownloadLinkInstall": "https://github.com/StrawberryClover/AggroRangeVisualizer/releases/download/v0.1_DT/latest.zip",
		"DownloadLinkTesting": "https://github.com/StrawberryClover/AggroRangeVisualizer/releases/download/v0.1_DT/latest.zip",
		"DownloadLinkUpdate": "https://github.com/StrawberryClover/AggroRangeVisualizer/releases/download/v0.1_DT/latest.zip",
		"DownloadCount": 69,
		"LastUpdate": "1720144223"
	}
]
