[
    {
        "Author": "Clover",
        "Name": "Immersive Flavor Text",
        "Punchline": "It provides more immersive flavor text.",
        "Description": "My garbage quality plugin to help me learn how to work with Dalamud.\r\nSomewhat of a RP toolkit, so far it only provides immersive flavor text.",
        "InternalName": "rpToolkit",
        "AssemblyVersion": "0.2.6",
        "ApplicableVersion": "any",
        "DalamudApiLevel": 8,
        "LoadPriority": 0,
        "RepoUrl": "https://github.com/StrawberryClover/ImmersiveFlavorText",
        "IconUrl": "https://cdn.iconscout.com/icon/free/png-256/rain-drops-1671402-1422407.png",
	"Changelog": "- Added climate data for zones: Mist, Old Sharlayan, Eulmore, Doman Enclave, Yanxia\r\n- Added climate data for sub zones: Hells' Lid, Restricted Archives, Eulmore Derelicts, Skyfront, Zero's Domain, Storm's Crown\r\n- Added climate data for duties: The Whorleater, Castrum Fluminis, Alzadaal's Legacy, Limitless Blue, Howling Eye, Dancing Plague, Emanation, Thornmarch, Fell Court of Troia\r\n- Changed climate data for: The Bowl of Embers\r\n- Added new biome type: Volcanic Region, Crystalline\r\n- Added new weather: Gales (Howling Eye)\r\n- [Feature] The temperature now cools off in the shade, proportional to how hot it is. This is an extremely experimental feature, and it doesn't work the best - For example, the shade of tree leaves will not cool you off because there is no collision on them, and for some reason all of Rak'tika is considered shade. As such, you can disable this option in the configuration.\r\n- [Feature] Can now segregate zones into subzones or sub areas, allowing for more diverse temperature control depending on what area of the zone you are in",
        "ImageUrls": [],
        "DownloadLinkInstall": "https://github.com/StrawberryClover/ImmersiveFlavorText/releases/download/v0.2.6/latest.zip",
        "IsHide": false,
        "IsTestingExclusive": false,
        "DownloadLinkTesting": "https://github.com/StrawberryClover/ImmersiveFlavorText/releases/download/v0.2.6/latest.zip",
        "DownloadLinkUpdate": "https://github.com/StrawberryClover/ImmersiveFlavorText/releases/download/v0.2.6/latest.zip",
        "DownloadCount": 69,
        "LastUpdate": "1670826834",
	"AcceptsFeedback": true
    }
]
